Tekla Open API Reference for Tekla Structures 2025
Text Constructor (ViewBase, Point, String, PlacingBase)
 Creates a new text instance with the given text string using a specific placing type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Text(
	ViewBase view,
	Point insertionPoint,
	string text,
	PlacingBase Placing
)
Public Sub New (
	view As ViewBase,
	insertionPoint As Point,
	text As String,
	Placing As PlacingBase
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
insertionPoint
Type: Tekla.Structures.Geometry3d.Point
The insertion point to be used.
text
Type: System.String
The text string to be used.
Placing
Type: Tekla.Structures.Drawing.PlacingBase
The placing type to be used.
See Also
Reference
Text Class
Text Overload
Tekla.Structures.Drawing Namespace